//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมหมุนตัวหุ่นยนต์บนเส้นดำ --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
int p ;           // ความเร็วในการเคลื่อนที่ 0-100%
int ref = 500 ;   // ค่าอ้างอิงเพื่อใช้ในเงื่อนไข
void setup() {
  set_robot();    
  OK(LR);         // หยุดรอ , แสดงค่าเซนเซอร์ L(A3) และ R(A0)
}
void loop() {
  p = 60  ;       // กำหนดความเร็วเริ่มต้นที่ 60%
  L90(p);         // ใช้งานฟังก์ชั่นหมุนตัวบนเส้นดำ ทางด้านซ้าย
  //R90(p);       // ใช้งานฟังก์ชั่นหมุนตัวบนเส้นดำ ทางด้านขวา  
  OK(LR);
}
//*
//*
//************* ฟังก์ชั่นสำหรับหมุนซ้ายบนเส้นดำ *************
void L90(int p)
{
  motor(-p, p);  delay(300);    // หมุนซ้ายเล็กน้อย เพื่อให้เซนเซอร์อยู่บนพื้นขาว
  while (analog(3) > ref ) ;    // วนลูปหากเซนเซอร์อยู่บนพื้นขาว(หุ่นหมุนซ้ายต่อเนื่อง)
  while (analog(3) < ref ) ;    // วนลูปหากเซนเซอร์อยู่บนเส้นดำ
  motor(p, -p);  delay(50);     // หยุดหมุนซ้ายเมื่อพ้นเส้นดำ และกลับทางเพื่อเบรค
  ao();
}
//************* ฟังก์ชั่นสำหรับหมุขวาบนเส้นดำ *************
void R90(int p)
{
  motor(p, -p);  delay(300);    // หมุนซ้ายเล็กน้อย เพื่อให้เซนเซอร์อยู่บนพื้นขาว
  while (analog(0) > ref ) ;    // วนลูปหากเซนเซอร์อยู่บนพื้นขาว(หุ่นหมุนซ้ายต่อเนื่อง)
  while (analog(0) < ref ) ;    // วนลูปหากเซนเซอร์อยู่บนเส้นดำ
  motor(-p, p);  delay(50);     // หยุดหมุนซ้ายเมื่อพ้นเส้นดำ และกลับทางเพื่อเบรค
  ao();
}
