//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมทดสอบการนับพัลส์ของ Encoder --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();  // กำนหนดค่าของบอร์ด CP32
  OK(XA2);      // หยุดรอ , แสดงค่าช่อง XA2 ที่ต่อกับ Encoder
}
void loop() {
  //  ----- Encoder test -----
  motor(40, 0);     // ให้มอเตอร์ด้านซ้ายหมุนไปข้างหน้า
  encoder_sb(10);   // อ่านค่า Encoder พร้อมทั้งมีเสียงเมื่อนับพัลส์
  OK(XA2);          // กด OK เพื่อเริ่มทดสอบอีกครั้ง
}
