//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมทดสอบการเคลื่อนที่ด้วย Encoder --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();      // กำนหนดค่าของบอร์ด CP32
  OK(XA2);          // หยุดรอ , แสดงค่าช่อง XA2 ที่ต่อกับ Encoder
}
void loop() {
  motor(60, 60);     // เคลื่อนที่ตรงไป 60%
  encoder(40);       // ให้ล้อหมุนไประยะ 40 พัลส์
  motor(60,-60);     // หมุนตัวไปด้านขวา
  encoder(15);       // ให้ล้อหมุนไประยะ 15 พัลส์ (180องศา)
  motor(60, 60);  encoder(40);     // เคลื่อนที่ตรงไป 60% จำนวน 40 พัลส์กลับไปยังจุดเริ่มต้น    
  OK(XA2);       // กด OK เพื่อเริ่มทดสอบอีกครั้ง
}
