//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมหุ่นยนต์ซูโม่ ใช้เซนเซอร์ A3(ด้านซ้าย) , A0(ด้านขวา)  --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
int p ;           // ความเร็วในการเคลื่อนที่ 0-100%
int ref = 500 ;   // ค่าอ้างอิงเพื่อใช้ในเงื่อนไข
void setup() {
  set_robot();    // กำนหนดค่าของบอร์ด CP32
  OK(LR);         // แสดงค่าเซนเซอร์ช่อง A3(ด้านซ้าย) , A0(ด้านขวา)
}
void loop() {
  p = 50 ;
  chk_wall(p);    // เรียกใช้ฟังก์ชั่นเดินตามเส้นกำแพง (เดินในสนามหุ่ยนต์ซูโม่)
}

void chk_wall(int p)
{
  motor( p , p );       // เดินตรง
  delay( 20 );
  if ( analog(3) < ref )              // ตรวจสอบด้านซ้าย(A3) ว่าเป็นเส้นดำหรือไม่
  {
    motor(-p, -p);    delay(1000);    // ถ้าหากเป็นสีดำ ให้ ถอยหลังและ หมุนไปทางขวา
    motor( p, -p);    delay(800);
  }
  if ( analog(0) < ref )              // ตรวจสอบด้านขวา(A0) ว่าเป็นเส้นดำหรือไม่
  {
    motor(-p, -p);    delay(1000);    // ถ้าหากเป็นสีดำ ให้ ถอยหลังและ หมุนไปทางซ้าย
    motor(-p,  p);    delay(600);
  }



}
