//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมหุ่นยนต์เดินตามเส้นแบบ 4 เซนเซอร์ --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
int p ;           // ความเร็วในการเคลื่อนที่ 0-100%
int ref = 500 ;   // ค่าอ้างอิงเพื่อใช้ในเงื่อนไข
void setup() {
  set_robot(); 
  OK(LLRR);       // หยุดรอ , แสดงค่าเซนเซอร์ L(A3),R(A0) และ LL(A7) , RR(XA3)
}
void loop() {
  p = 70  ;   // กำหนดความเร็ว
  LL(p);      // เรียกใช้ฟังก์ชั่นต่างๆ ตามรูปแบบสนาม
  RR(p);
  .
  .
  .
  OK();       // หยุดเคลื่อนที่
}
//************* ฟังก์ชั่นสำหรับเคลื่อนที่ตรงไปเมื่อเจอทางแยก *************
void FF(int p )
{
  while (analog(7) > ref && analog(XA3) > ref  )    // ใช้เซนเซอร์ด้านข้างตรวจสอบ ถ้าเป็นสีขาวทั้งคู่ให้จะแทร็กเส้นดำ
    track_line(p);                                  // แต่หากมีตัวใดเป็นสีดำ จะหยุดแทร็กเส้นทันที
  motor( p , p);   delay(200);          // เดินหน้าให้ผ่านทางแยก
  ao(); sbeep();   delay(250);          // หยุดการเคลื่อนที่และมีเสียงเตือน
}
void LL(int p )
{
  while (analog(7) > ref )  track_line(p);       // ใช้เซนเซอร์ด้านซ้ายตรวจสอบ ถ้าเป็นสีขาวให้แทร็กเส้นเรื่อยๆ
  motor( p , p);   delay(200);   // เดินหน้าให้ผ่านทางแยก
  ao(); sbeep();   delay(250);          
  L90(p);                       // หมุนซ้ายตรงทางแยก
}
void RR(int p )
{
  while (analog(XA3) > ref )  track_line(p);    // ใช้เซนเซอร์ด้านขวาตรวจสอบ ถ้าเป็นสีขาวให้แทร็กเส้นเรื่อยๆ
  motor( p , p);   delay(200);    // เดินหน้าให้ผ่านทางแยก
  ao(); sbeep();   delay(250);
  R90(p);                         // หมุนขวาตรงทางแยก
}
//************* ฟังก์ชั่นสำหรับหมุนซ้ายบนเส้นดำ *************
void L90(int p)
{
  motor(-p, p);  delay(300);    // หมุนซ้ายเล็กน้อย เพื่อให้เซนเซอร์อยู่บนพื้นขาว
  while (analog(3) > ref ) ;    // วนลูปหากเซนเซอร์อยู่บนพื้นขาว(หุ่นหมุนซ้ายต่อเนื่อง)
  while (analog(3) < ref ) ;    // วนลูปหากเซนเซอร์อยู่บนเส้นดำ
  motor(p, -p);  delay(50);     // หยุดหมุนซ้ายเมื่อพ้นเส้นดำ และกลับทางเพื่อเบรค
  ao();
}
//************* ฟังก์ชั่นสำหรับหมุขวาบนเส้นดำ *************
void R90(int p)
{
  motor(p, -p);  delay(300);    // หมุนซ้ายเล็กน้อย เพื่อให้เซนเซอร์อยู่บนพื้นขาว
  while (analog(0) > ref ) ;    // วนลูปหากเซนเซอร์อยู่บนพื้นขาว(หุ่นหมุนซ้ายต่อเนื่อง)
  while (analog(0) < ref ) ;    // วนลูปหากเซนเซอร์อยู่บนเส้นดำ
  motor(-p, p);  delay(50);     // หยุดหมุนซ้ายเมื่อพ้นเส้นดำ และกลับทางเพื่อเบรค
  ao();
}
//******************************
void track_line(int power)
{
  int senL = analog(3) , senR = analog(0);      // กำหนดตัวแปรและอ่านค่า Analog
  if (senL > ref && senR > ref) // ซ้ายและขวา สีขาว  คล่อมเส้นดำ
    motor(power, power);
  else  if (senL < ref && senR > ref) // ซ้ายเจอเส้นสีดำ หุ่นยนต์เอียงขวา
    motor(-power, power);
  else  if (senL > ref && senR < ref) // ขวาเจอเส้นสีดำ หุ่นยนต์เอียงซ้าย
    motor(power, -power);
}
