//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมทดสอบแสดงตำแหน่ง  x y บนหน้าจอ --------
//-------- หมุนปรับที่ pot เพื่อเปลี่ยนตำแหน่งแสดงผล --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();        // กำนหนดค่าของบอร์ด CP32
  disXY();            // ฟังก์ชั่นแสดงตำแหน่ง x y
}
void loop() {
}
//*********************************************************
void disXY(void)
{
  int  x, y;              // ประกาศตัวแปรตำแหน่ง  x  y
  OLED.setTextSize(1);    // ขนาดตัวอักษร
  while (1)
  {
    OLED.clearDisplay();    // ล้างหน้าจอ OLED
    x = pot(0 , 127);     y = pot(0 ,  63);       // ใช้ฟังก์ชั่น pot หมุนกำหนดค่าให้ x และ y
    OLED.fillCircle( x, y , 1 , SSD1306_WHITE);   // แสดงจุดวงกลมที่ตำแหน่ง x,y

    //--------------- ส่วนคำสั่งเงื่อนไข ตรวจเช็คตำแหน่ง เพื่อให้ข้อความแสดงได้บนจอ OLED -------------
    if (x <= 92)
      OLED.setCursor( x + 5 , y);
    else
      OLED.setCursor( 70 , 25);
    //-------------------------------------------------------------------------------------
    OLED.print( x  , DEC); OLED.print(","); OLED.print( y  , DEC);    // แสดงตัวเลข x , y บนจอ OLED
    OLED.display();       // เริ่มการแสดงผล
    delay(1);
  }
}
