//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมหุ่นยนต์เดินตามเส้นแบบ 1 เซนเซอร์ --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
int p ;           // ความเร็วในการเคลื่อนที่ 0-100%
int ref = 500 ;   // ค่าอ้างอิงเพื่อใช้ในเงื่อนไข
void setup() {
  set_robot();  
  OK(XA3);        // หยุดรอ , แสดงค่าเซนเซอร์ช่อง XA3
}
void loop() {
  p = 50  ;         // กำหนดความเร็วเริ่มต้นที่ 60%
  track_line1(p);   // ใช้งานฟังก์ชั่นเดินตามเส้น 1 เซนเซอร์
}
//*
//*
//************* ฟังก์ชั่นหุ่นยนต์เดินตามเส้น 1 เซนเซอร์ *************
void track_line1(int power) // เดินตามเส้น โดยเกาะไปทางด้านขวาของเส้นดำ
{ int sen = analog(XA3);    // ใช้เซนเซอร์ช่อง XA3
  if (sen < ref )
  {
    motor(power, -30); // เมื่อเจอสีดำ ให้หมุนขวา
    delay(10);         // แต่ล้อขวาจะหมุนน้อยกว่าล้อซ้าย ทำให้ได้ระยะไปด้านหน้า
  }
  else
  {
    motor(0 , power);  // เมื่อเจอสีขาว ให้หมุนซ้าย
    delay(10);         // โดยหยุดล้อซ้าย ทำให้ได้ระยะไปด้านหน้าด้วยเช่นกัน
  }
}
