//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมทดสอบการทำงานของมอเตอร์ --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();        // กำนหนดค่าของบอร์ด CP32
  OK();               // หยุดรอกดสวิคช์ OK เพื่อเริ่มโปรแกรม
}
void loop() {
  int  p = 60 ;                 // กำหนดความเร็วที่ 60%
  motor(p, p);   delay(2000);   // หุ่นยนต์ตรงไป
  motor(-p, -p);  delay(2000);  // หุ่นยนต์ถอยหลัง
  motor(-p, p);  delay(2000);   // หุ่นยนต์หมุนซ้าย
  motor(p, -p);  delay(2000);   // หุ่นยนต์หมุนขวา
  ao(); delay(1000);            // หุ่นยนต์หยุดการเคลื่อนที่ เป็นเวลา 1 วินาที
  
  motorL( p);  delay(2000);     // ล้อซ้ายหุ่นยนต์หมุนไปข้างหน้า
  motorL(-p);  delay(2000);     // ล้อซ้ายหุ่นยนต์หมุนกลับทาง
  ao(); delay(1000);            // หุ่นยนต์หยุดการเคลื่อนที่ เป็นเวลา 1 วินาที
  
  motorR( p);  delay(2000);     // ล้อขวาหุ่นยนต์หมุนไปข้างหน้า
  motorR(-p);  delay(2000);     // ล้อขวาหุ่นยนต์หมุนกลับทาง
  ao(); delay(1000);            // หุ่นยนต์หยุดการเคลื่อนที่ เป็นเวลา 1 วินาที
}
