//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมหุ่นยนต์เดินตามเส้นแบบจับเวลา [ 1 และ 2 เซนเซอร์ ] --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
int p ;
int ref = 500 ;
void setup() {
  set_robot();        // กำนหนดค่าของบอร์ด CP32
  OK(LR);
}
void loop()
{ p = 90 ;
  track_millis(2000);   // ให้หุ่ยนต์แทร็กเส้นที่เวลา 2000mS [2วินาที]
  OK(LR);               // กด OK เพิ่มเริ่มอีกครั้ง
}
//-------------------------------------------------------------------
//-------------------------------------------------------------------
//-------------------------------------------------------------------
void track_millis(unsigned long time_set )
{
  unsigned long pre_tm ;   // กำหนดค่าตัวแปรเวลาที่เริ่มต้นนับเวลา
  unsigned long cur_tm ;   // กำหนดค่าตัวแปรเวลาปัจจุบัน
  pre_tm = millis();       // ให้ค่าเวลาปัจจุบันเป็นค่าเริ่มต้น
  while (( millis() - pre_tm  ) < time_set )    // วนลูปเมื่อค่าเวลากำลังนับในช่วงค่า time_set
  {
    track_line1(p);        // คำสั่งที่ต้องการทำเมื่ออยู่ในเวลาที่กำลังนับ [แทร็คเส้น 1 เซนเซอร์]
    //track_line(p);         // ทดสอบแทร็คเส้น 2 เซนเซอร์
  }
  cur_tm = millis();
  //--------------------- ส่วนแสดงผลค่าเวลา ---------------------
  //************* ฟังก์ชั่นหุ่นยนต์เดินตามเส้น 2 เซนเซอร์ *************
  ao();
  OLED.setCursor( 0 , 0);
  OLED.print( cur_tm , DEC);              OLED.println(" Now\n");
  OLED.print( cur_tm - pre_tm , DEC);     OLED.println(" mS");
  OLED.display(); delay(1000);
}
//--------------------- ฟังก์ชั่นเดินตามเส้น ---------------------
void track_line(int p)
{
  int senL = analog(3) , senR = analog(0);      // กำหนดตัวแปรและอ่านค่า Analog
  if (senL > ref && senR > ref) // ซ้ายและขวา สีขาว  คล่อมเส้นดำ
    motor(p, p);
  else  if (senL < ref && senR > ref) // ซ้ายเจอเส้นสีดำ หุ่นยนต์เอียงขวา
    motor(-p, p);
  else  if (senL > ref && senR < ref) // ขวาเจอเส้นสีดำ หุ่นยนต์เอียงซ้าย
    motor(p, -p);
}
//************* ฟังก์ชั่นหุ่นยนต์เดินตามเส้น 1 เซนเซอร์ *************
void track_line1(int power) // เดินตามเส้น โดยเกาะไปทางด้านขวาของเส้นดำ
{ int sen = analog(0);    // ใช้เซนเซอร์ช่อง XA3
  if (sen < ref )
  {
    motor(power, -30); // เมื่อเจอสีดำ ให้หมุนขวา
    delay(10);         // แต่ล้อขวาจะหมุนน้อยกว่าล้อซ้าย ทำให้ได้ระยะไปด้านหน้า
  }
  else
  {
    motor(0 , power);  // เมื่อเจอสีขาว ให้หมุนซ้าย
    delay(10);         // โดยหยุดล้อซ้าย ทำให้ได้ระยะไปด้านหน้าด้วยเช่นกัน
  }
}
