//-------หุ่นยนต์ BM_V2 ใช้บอร์ด CP-32 ในการควบคุมการทำงาน BO1  1:48
//---------First Edit 01/09/65-------
//---------ใช้โปรแกรมคาลิเบทสำหรับเก็บค่าพื้นสีดำ สีขาว อัตโนมัติ--------
#include <CP32.h>
int p = 00 ;        // กำลังของมอเตอร์(%)
void setup() {
  set_robot();
  //---------------------SET FOR BM V2
  set_BM_V2();
  pos_1();          // ชุดส่งกล่อง  เซอร์โวต่อช่อง SV1 (ตำแหน่งเริ่มต้น ใส่กล่องได้ 5 ใบ)
  //========ตรวจสอบการกดสวิตช์เพื่อคาลิเบท=========
  if (!press_OK()) Calibrate_MODE(60);    // หุ่นยนต์ไม่เคลื่อนที่  ให้จับหุ่นยนต์กวาดไปบนเส้นดำและขาว ช้าๆ
  //========================================
  OK_Calibrate();
} // setup


void loop() {
  p = pot(0, 100);      //--------หมุนปรับความเร็วที่ pot ปกติ 50%
  //----- 00.ทดสอบมอเตอร์
  move_test();

  //----- 01.ฟังก์ชั่นสำหรับส่งกล่อง
  //  encoder_test();

  //----- 02.ฟังก์ชั่นสำหรับส่งกล่อง
  //  send_BOX();

  //----- 1.ทดสอบแทรกเส้นดำด้านข้าง
  //      track_wall(p);        //  เคลื่อนที่แทร็กเส้นดำด้านข้าง

  //----- 2.ทดสอบฟังก์ชั่นตั้งลำหุ่นยนต์ โดยใช้เซนเซอร์ด้านหน้า 2 ตัว
  //    track_wall(p);          //  เคลื่อนที่แทร็กเส้นดำด้านข้าง
  //    setbot_front(p - 5);   //  ตั้งลำตัวหุ่นยนต์
  //    RV_encoder(p, 10);      //  เดินถอยหลังออกจากเส้น

  //----- 3.ทดสอบฟังก์ชั่นตั้งลำหุ่นยนต์ โดยใช้เซนเซอร์ด้านหลัง 2 ตัว
  //  setbot_rear(p);         //  ตั้งลำตัวหุ่นยนต์
  //  FD_encoder(p, 20);      //  ตรงไปออกจากเส้นระยะ 70 step

  ao();  beep(); delay(200);
  OK_Calibrate();
}
//=========================================
//=========================================
void move_test(void)
{
  motor(p, p);     delay(5000); // ตรง
  motor(-p, -p);   delay(5000); // ถอย
  motor(-p, p);    delay(1500); // หมุนซ้าย
  motor(p, -p);    delay(1500); // หมุนขวา
}

void encoder_test(void)
{
  FD_encoder(p, 50);     // เคลื่อนที่ตรง จำนวน 50 step
  delay(500);
  RV_encoder(p, 25);     // ถอยหลัง จำนวน 55 step
  delay(500);
  LL_encoder(p, 10);     // หมุนซ้าย จำนวน 10 step
  delay(500);
  RR_encoder(p, 20);     // หมุนขวา จำนวน 10 step
  delay(500);
  LL_encoder(p, 10);
  delay(500);
  //---------------------------------
  RV_encoder(p, 25);
}
