//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมหุ่นยนต์ซูโม่ ใช้เซนเซอร์ A3(ด้านซ้าย) --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();    // กำนหนดค่าของบอร์ด CP32
  OK(LR);         // แสดงค่าเซนเซอร์ช่อง A3(ด้านซ้าย) , A0(ด้านขวา)
}
void loop() {
  int ref = 500 ;               // ค่าอ้างอิงเซนเซอร์แสง
  while ( analog(3) > ref )             // ตรวจสอบด้านซ้าย(A3) ว่าเป็นพื้นขาวหรือไม่
    motor( 50 , 50 );                   // ถ้าเป็นจริงให้เดินตรงไป
  motor(-50, -50);    delay(1000);      // ถ้าหากเป็นสีดำ ให้ ถอยหลังและ หมุนไปทางขวา
  motor( 50, -50);    delay(500);       // เพื่อไม่ให้ออกนอกสนาม  
}
