//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมสวิคช์ OK หยุดรอและแสดงค่าเซนเซอร์ แบบต่างๆ --------
#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();        // กำนหนดค่าของบอร์ด CP32
}
void loop() {
    // คำสั่ง OK  จะหยุดรอการกด และแสดงค่า ตามพารามิเตอร์ที่ส่งไปในฟังก์ชั่น
    OK();     delay(1000);    // แสดงข้อความและ OK กระพริบ
    OK(LR);   delay(1000);    // แสดงค่าเซนเซอร์ช่อง A3(ด้านซ้าย) , A0(ด้านขวา)  และ อัลตร้าโซนิค
    OK(LCR);  delay(1000);    // แสดงค่าเซนเซอร์ช่อง A3(ด้านซ้าย) , A0(ด้านขวา)  , XA3(กลาง)  
    OK(LLRR); delay(1000);    // แสดงค่าเซนเซอร์ช่อง A3(ด้านซ้าย) , A0(ด้านขวา)  , A7(ริมซ้าย)  ,XA3(ริมขวา)  
    OK(7);    delay(1000);    // แสดงค่าเซนเซอร์ช่อง A7
    OK(XA2);  delay(1000);    // แสดงค่าเซนเซอร์ช่อง XA2 
}
