//---------- CP-32 Training Board ---------------
//---- https://www.facebook.com/mnrobot/ --------
//---
//---
//-------- โปรแกรมทดสอบการทำงานของเซอร์โวมอเตอร์ --------

#include <CP32.h>     // เรียกใช้ไลบารี่ของ CP32
void setup() {
  set_robot();        // กำนหนดค่าของบอร์ด CP32
  OK();               // หยุดรอกดสวิคช์ OK เพื่อเริ่มโปรแกรม
}
void loop() {
//---------------- ควบคุมทีละตัว ----------------
  servo( 1 , 90 );     // เซอร์โซ SV1  หมุนไปตำแหน่ง 90 องศา
  delay(2000);
  servo( 1 , 120 );    // ตำแหน่ง 120 องศา
  delay(2000);
  servo( 1 ,  70 );    // ตำแหน่ง  70 องศา
  delay(2000);
  servo( 2 , 90 );     // เซอร์โซ SV2  หมุนไปตำแหน่ง 90 องศา
  delay(2000);
  servo( 2 , 120 );    // ตำแหน่ง 120 องศา
  delay(2000);
  servo( 2 ,  70 );    // ตำแหน่ง  70 องศา
  delay(2000);
//---------------- ควบคุมตำแหน่งทั้งหมด ----------------  
  servo( ALL ,  90 );   delay(2000);
  servo( ALL , 140 );   delay(2000);
  servo( ALL ,  70 );   delay(2000);
  servo( ALL , -1 );    // หยุดการจ่ายไฟให้เซอร์โวมอเตอร์
  OK();
}
